//==========================================================
// キャラクターのボディのオブジェクト
#ifndef _INC_CHARACTER_BODY_H
#define _INC_CHARACTER_BODY_H

//==========================================================
// インクルード
#include	"RigidBody.h"

//==========================================================
// クラス定義
class CCharacterBody : public CRigidBody {
public:
	//==========================================================
	// 定数

	//==========================================================
	// 関数

	// キャラクターとしての初期化をする
	void Init();


private:

public:
	CCharacterBody();
	~CCharacterBody();
};

#endif